In [3]:
import numpy as np
import pandas as pd
import seaborn as sns

In [9]:
#1. 타이타닉 오픈
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
# 2. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오.
#       category1 카테고리는 다음과 같이 정의됨
#       2.1) 20살이 넘으면 성별을 그대로 사용한다.
#       2.2) 20살 미만이면 성별에 관계없이 “child”라고 한다.

# 2. 열추가
# 2.1 추가열에 값 추가

titanic["category1"] = titanic.apply(lambda r: r.age if r.age >= 20 else "child", axis =1)
titanic.head(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.0
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,54.0
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,child
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,27.0
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False,child
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True,58.0
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,20.0
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False,39.0
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True,child
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True,55.0
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False,child
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,child
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False,31.0
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,child

In [17]:
# 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값
# 이 되도록 titanic 데이터프레임을 고치시오.

# 평균 나이값 찾기
titanic.age.fillna(titanic.age.mean(), inplace=True)
titanic.head(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.0
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.0
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.0
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.0
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.0
5,0,3,male,29.699118,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child
6,0,1,male,54.000000,0,0,51.8625,S,First,man,True,E,Southampton,no,True,54.0
7,0,3,male,2.000000,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,child
8,1,3,female,27.000000,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,27.0
9,1,2,female,14.000000,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child
10,1,3,female,4.000000,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False,child
11,1,1,female,58.000000,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True,58.0
12,0,3,male,20.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,20.0
13,0,3,male,39.000000,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False,39.0
14,0,3,female,14.000000,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True,child
15,1,2,female,55.000000,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True,55.0
16,0,3,male,2.000000,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False,child
17,1,2,male,29.699118,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,child
18,0,3,female,31.000000,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False,31.0
19,1,3,female,29.699118,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,child

In [22]:
# 성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.
titanic.groupby(["sex", "class","embark_town"])[["survived"]].mean()

                           survived
sex    class  embark_town
female First  Cherbourg    0.976744
              Queenstown   1.000000
              Southampton  0.958333
       Second Cherbourg    1.000000
              Queenstown   1.000000
              Southampton  0.910448
       Third  Cherbourg    0.652174
              Queenstown   0.727273
              Southampton  0.375000
male   First  Cherbourg    0.404762
              Queenstown   0.000000
              Southampton  0.354430
       Second Cherbourg    0.200000
              Queenstown   0.000000
              Southampton  0.154639
       Third  Cherbourg    0.232558
              Queenstown   0.076923
              Southampton  0.128302

In [30]:
# d. 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고,
# 각 그룹별 생존율을 구하시오.
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

titanic["age_group"] = pd.cut(titanic["age"], bins, labels=labels)
titanic.groupby(["age_group"])[["survived"]].mean()

           survived
age_group
미성년자       0.424242
청년         0.334152
중년         0.423237
장년         0.355932
노년         0.200000

In [40]:
# 3. Mile Per Gallon - sns.load_dataset('mpg')
mpg = sns.load_dataset("mpg")
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [41]:
# a. 배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

mpg["displacement"] = 0
mpg["horsepower"] = 0
mpg["hp_per_cc"] = 0
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,0,0,3504,12.0,70,usa,chevrolet chevelle malibu,0
1,15.0,8,0,0,3693,11.5,70,usa,buick skylark 320,0
2,18.0,8,0,0,3436,11.0,70,usa,plymouth satellite,0
3,16.0,8,0,0,3433,12.0,70,usa,amc rebel sst,0
4,17.0,8,0,0,3449,10.5,70,usa,ford torino,0

In [42]:
# b. name으로부터 manufacturer(제조사)와 모델을 추출하여
# 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.
mpg["manufacturer"] = mpg.name.apply(lambda x: x.split()[0])
mpg["model"]= mpg.name.apply(lambda x: ' '.join(x.split()[1:]))
mpg.drop(["name"],axis=1,inplace=True)
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,0,0,3504,12.0,70,usa,0,chevrolet,chevelle malibu
1,15.0,8,0,0,3693,11.5,70,usa,0,buick,skylark 320
2,18.0,8,0,0,3436,11.0,70,usa,0,plymouth,satellite
3,16.0,8,0,0,3433,12.0,70,usa,0,amc,rebel sst
4,17.0,8,0,0,3449,10.5,70,usa,0,ford,torino

In [43]:
# c. 엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.
mpg.groupby(["cylinders"])[["mpg"]].mean()

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [44]:
# 생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.
mpg.groupby(["origin"])[["hp_per_cc"]].mean()

        hp_per_cc
origin
europe        0.0
japan         0.0
usa           0.0

In [45]:
# 모델이 5개 이상인 제조사에 대하여
# 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.
mpg.groupby(["manufacturer"]).count()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,model
manufacturer,,,,,,,,,,
amc,28,28,28,28,28,28,28,28,28,28
audi,7,7,7,7,7,7,7,7,7,7
bmw,2,2,2,2,2,2,2,2,2,2
buick,17,17,17,17,17,17,17,17,17,17
cadillac,2,2,2,2,2,2,2,2,2,2
capri,1,1,1,1,1,1,1,1,1,1
chevroelt,1,1,1,1,1,1,1,1,1,1
chevrolet,43,43,43,43,43,43,43,43,43,43
chevy,3,3,3,3,3,3,3,3,3,3
chrysler,6,6,6,6,6,6,6,6,6,6
datsun,23,23,23,23,23,23,23,23,23,23
dodge,28,28,28,28,28,28,28,28,28,28
fiat,8,8,8,8,8,8,8,8,8,8
ford,51,51,51,51,51,51,51,51,51,51
hi,1,1,1,1,1,1,1,1,1,1
honda,13,13,13,13,13,13,13,13,13,13
maxda,2,2,2,2,2,2,2,2,2,2
mazda,10,10,10,10,10,10,10,10,10,10
mercedes,1,1,1,1,1,1,1,1,1,1
mercedes-benz,2,2,2,2,2,2,2,2,2,2
mercury,11,11,11,11,11,11,11,11,11,11
nissan,1,1,1,1,1,1,1,1,1,1
oldsmobile,10,10,10,10,10,10,10,10,10,10
opel,4,4,4,4,4,4,4,4,4,4
peugeot,8,8,8,8,8,8,8,8,8,8
plymouth,31,31,31,31,31,31,31,31,31,31
pontiac,16,16,16,16,16,16,16,16,16,16
renault,5,5,5,5,5,5,5,5,5,5
saab,4,4,4,4,4,4,4,4,4,4
subaru,4,4,4,4,4,4,4,4,4,4
toyota,25,25,25,25,25,25,25,25,25,25
toyouta,1,1,1,1,1,1,1,1,1,1
triumph,1,1,1,1,1,1,1,1,1,1
vokswagen,1,1,1,1,1,1,1,1,1,1
volkswagen,15,15,15,15,15,15,15,15,15,15
volvo,6,6,6,6,6,6,6,6,6,6
vw,6,6,6,6,6,6,6,6,6,6